In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [ ]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df.FlightNumber[0]

10045.0

In [ ]:
for ele in range(len(df.FlightNumber)):
  if pd.isna(df.FlightNumber[ele]) :
    df.FlightNumber[ele] = df.FlightNumber[ele-1] + 10

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [ ]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [ ]:
place = pd.DataFrame(df['From_To'])

In [ ]:
place.head()

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_PaRis
4   Brussels_londOn

In [ ]:
place['From_To'].values

array(['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
       'Budapest_PaRis', 'Brussels_londOn'], dtype=object)

In [ ]:
place['From'] = df['From_To'].apply(lambda x:x.split('_')[0])

In [ ]:
place['To'] = df['From_To'].apply(lambda x:x.split('_')[1])

In [ ]:
place.head()

            From_To      From         To
0      LoNDon_paris    LoNDon      paris
1      MAdrid_miLAN    MAdrid      miLAN
2  londON_StockhOlm    londON  StockhOlm
3    Budapest_PaRis  Budapest      PaRis
4   Brussels_londOn  Brussels     londOn

In [ ]:
place['From'] = place['From'].apply(lambda x : x[0].upper() + x[1:].lower())

In [ ]:
place['To'] = place['To'].apply(lambda x : x[0].upper() + x[1:].lower())

In [ ]:
place.head()

            From_To      From         To
0      LoNDon_paris    London      Paris
1      MAdrid_miLAN    Madrid      Milan
2  londON_StockhOlm    London  Stockholm
3    Budapest_PaRis  Budapest      Paris
4   Brussels_londOn  Brussels     London

In [ ]:
df.drop('From_To', axis = 1, inplace=True )

In [ ]:
df = pd.concat([df,place[['From','To']]], axis = 1)

In [ ]:
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London